tivacc/token4SZT/inmiga/mcu/EWARM/HC32L15.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PARITY</name>
            <description>desc PARITY</description>
            <baseAddress>0x4003C000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x14</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CTL</name>
                    <description>desc CTL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13</resetMask>
                    <fields>
                        <field>
                            <name>PE</name>
                            <description>desc PE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIE</name>
                            <description>desc PIE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PERROR</name>
                            <description>desc PERROR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR</name>
                    <description>desc ADDR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>desc ADDR</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>PCG</name>
            <description>desc PCG</description>
            <baseAddress>0x4003C100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x28</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CLKEN0</name>
                    <description>desc CLKEN0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1001003F</resetValue>
                    <resetMask>0x1001003F</resetMask>
                    <fields>
                        <field>
                            <name>MSCCLK0</name>
                            <description>desc MSCCLK0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSCCLK1</name>
                            <description>desc MSCCLK1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSCCLK2</name>
                            <description>desc MSCCLK2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSCCLK4</name>
                            <description>desc MSCCLK4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSCCLK5</name>
                            <description>desc MSCCLK5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSCCLK6</name>
                            <description>desc MSCCLK6</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADCCLK</name>
                            <description>desc ADCCLK</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GIOCLK</name>
                            <description>desc GIOCLK</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTCTL0</name>
                    <description>desc RSTCTL0</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1003F</resetMask>
                    <fields>
                        <field>
                            <name>MSCRST0</name>
                            <description>desc MSCRST0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSCRST1</name>
                            <description>desc MSCRST1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSCRST2</name>
                            <description>desc MSCRST2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSCRST4</name>
                            <description>desc MSCRST4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSCRST5</name>
                            <description>desc MSCRST5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSCRST6</name>
                            <description>desc MSCRST6</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADCRST</name>
                            <description>desc ADCRST</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKEN1</name>
                    <description>desc CLKEN1</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x13</resetValue>
                    <resetMask>0x13</resetMask>
                    <fields>
                        <field>
                            <name>CTMCLK0123</name>
                            <description>desc CTMCLK0123</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTMCLK4567</name>
                            <description>desc CTMCLK4567</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCCLK</name>
                            <description>desc VCCLK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTCTL1</name>
                    <description>desc RSTCTL1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13</resetMask>
                    <fields>
                        <field>
                            <name>CTMRST0123</name>
                            <description>desc CTMRST0123</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTMRST4567</name>
                            <description>desc CTMRST4567</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VCRST</name>
                            <description>desc VCRST</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKEN2</name>
                    <description>desc CLKEN2</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x111110</resetValue>
                    <resetMask>0x111110</resetMask>
                    <fields>
                        <field>
                            <name>BUZCLK</name>
                            <description>desc BUZCLK</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AESCLK</name>
                            <description>desc AESCLK</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCICLK</name>
                            <description>desc SCICLK</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LCDCCLK</name>
                            <description>desc LCDCCLK</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTCTL2</name>
                    <description>desc RSTCTL2</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x111110</resetMask>
                    <fields>
                        <field>
                            <name>BUZRST</name>
                            <description>desc BUZRST</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AESRST</name>
                            <description>desc AESRST</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCIRST</name>
                            <description>desc SCIRST</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LCDCRST</name>
                            <description>desc LCDCRST</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
